require 'json'
require 'open-uri'
require 'net/http'
require 'openssl'

http = Net::HTTP.new('https://api.binance.com/api/v1/trades?symbol=ENJBTC&limit=1', 443)
http.use_ssl = true
http.verify_mode = OpenSSL::SSL::VERIFY_PEER
http.cert_store = OpenSSL::X509::Store.new
http.cert_store.set_default_paths
#http.cert_store.add_file('/path/to/cacert.pem')
response = http.get('/api/v1/trades?symbol=ENJBTC&limit=1')

puts response
#http.cert_store = OpenSSL::X509::Store.new
#http.cert_store.set_default_paths
#http.cert_store.add_file('/path/to/cacert.pem')
# ...or:
#cert = OpenSSL::X509::Certificate.new(File.read('mycert.pem'))
#http.cert_store.add_cert(cert)

# source = "https://api.binance.com/api/v1/trades?symbol=ENJBTC&limit=1"
# data = open(http).read()
#response = HTTP.get(http.url)
#put response

#data = JSON.parse(data)


#puts data.first["price"]





비트코인캐시 BCC/BTC	

버지 XVG/BTC	

20,516.332

즐겨찾기
--
아인스타이늄
EMC2/BTC	
0.00008760
1,999 KRW
-18.51%

9,606.318

즐겨찾기
--
이더리움
ETH/BTC	
0.04701099
1,073,026 KRW
+2.01%

7,868.927

즐겨찾기
--
비트코인골드
BTG/BTC	
0.02428177
554,231 KRW
+32.69%

6,701.236

즐겨찾기
--
에이다
ADA/BTC	
0.00002778
634 KRW
-6.56%

6,665.399

즐겨찾기
--
라이트코인
LTC/BTC	
0.01856004
423,633 KRW
-5.79%

6,182.790

즐겨찾기
--
리플
XRP/BTC	
0.00004151
947 KRW
-1.84%

5,338.677

즐겨찾기
--
엔엑스티
NXT/BTC	
0.00005360
1,223 KRW
+0.79%

5,128.903

즐겨찾기
--
네오
NEO/BTC	
0.00402500
91,871 KRW
-0.12%

4,444.790

즐겨찾기
--
모네로
XMR/BTC	
0.02645972
603,943 KRW
+29.40%

4,118.500

즐겨찾기
--
퀀텀
QTUM/BTC	
0.00322020
73,501 KRW
-8.52%

3,894.053

즐겨찾기
--
대시
DASH/BTC	
0.08910787
2,033,887 KRW
+36.18%

3,541.084

즐겨찾기
--
스텔라루멘
XLM/BTC	
0.00001369
312 KRW
-9.10%

3,307.738

즐겨찾기
--
어거
REP/BTC	
0.00513440
117,193 KRW
-23.37%

3,238.643

즐겨찾기
--
이더리움클래식
ETC/BTC	
0.00228698
52,200 KRW
+5.64%

3,001.705

즐겨찾기
--
디지바이트
DGB/BTC	
0.00000313
71.44 KRW
+37.28%

2,761.286

즐겨찾기
--
뉴이코노미무브먼트
XEM/BTC	
0.00005470
1,249 KRW
+4.45%

2,531.716

즐겨찾기
--
오미세고
OMG/BTC	
0.00104515
23,856 KRW
+0.93%

2,288.229

즐겨찾기
--
스트라티스
STRAT/BTC	
0.00065691
14,994 KRW
-3.94%

2,200.887

즐겨찾기
--
시아코인
SC/BTC	
0.00000125
28.53 KRW
+35.87%

2,080.936

즐겨찾기
--
지캐시
ZEC/BTC	
0.03689994
842,241 KRW
+8.49%

1,998.207

즐겨찾기
--
리스크
LSK/BTC	
0.00116148
26,511 KRW
+22.13%

1,861.255

즐겨찾기
--
파워렛저
POWR/BTC	
0.00005950
1,358 KRW
-1.00%

1,766.825

즐겨찾기
--
아크
ARK/BTC	
0.00044238
10,097 KRW
+21.20%

1,760.725

즐겨찾기
--
웨이브
WAVES/BTC	
0.00087700
20,018 KRW
-2.77%

1,359.448

즐겨찾기
--
레드코인
RDD/BTC	
0.00000026
5.93 KRW
+44.44%

1,303.723

즐겨찾기
--
나브코인
NAV/BTC	
0.00017858
4,076 KRW
+11.25%

1,201.531

즐겨찾기
--
코모도
KMD/BTC	
0.00046012
10,502 KRW
+38.36%

1,185.069

즐겨찾기
--
버트코인
VTC/BTC	
0.00049629
11,328 KRW
-3.09%

1,135.001

즐겨찾기
--
비트베이
BAY/BTC	
0.00001309
299 KRW
-11.91%

1,111.928

즐겨찾기
--
스토리지
STORJ/BTC	
0.00009354
2,135 KRW
+21.40%

1,076.843

즐겨찾기
--
엘비알와이크레딧
LBC/BTC	
0.00004295
980 KRW
-0.81%

1,067.152

즐겨찾기
--
그로스톨코인
GRS/BTC	
0.00012515
2,857 KRW
+3.43%

999.497

즐겨찾기
--
스테이터스네트워크토큰
SNT/BTC	
0.00001059
242 KRW
-7.59%

974.501

즐겨찾기
--
모나코
MCO/BTC	
0.00095901
21,889 KRW
+2.35%

831.511

즐겨찾기
--
시스코인
SYS/BTC	
0.00003504
800 KRW
-0.57%

794.376

즐겨찾기
--
모나코인
MONA/BTC	
0.00088888
20,289 KRW
+10.57%

775.473

즐겨찾기
--
텐엑스페이토큰
PAY/BTC	
0.00019552
4,463 KRW
+0.41%

744.642

즐겨찾기
--
메탈
MTL/BTC	
0.00052943
12,084 KRW
-0.48%

740.338

즐겨찾기
--
솔트
SALT/BTC	
0.00055500
12,668 KRW
-3.61%

717.808

즐겨찾기
--
골렘
GNT/BTC	
0.00003690
842 KRW
+12.53%

627.793

즐겨찾기
--
유빅
UBQ/BTC	
0.00021190
4,837 KRW
-13.51%

621.794

즐겨찾기
--
지코인
XZC/BTC	
0.00395000
90,159 KRW
+2.33%

620.016

즐겨찾기
--
리피오크레딧네트워크
RCN/BTC	
0.00001336
305 KRW
-9.61%

600.990

즐겨찾기
--
도지코인
DOGE/BTC	
0.00000033
7.53 KRW
+6.45%

533.664

즐겨찾기
--
애드엑스
ADX/BTC	
0.00009692
2,212 KRW
-6.57%

517.307

즐겨찾기
--
스팀
STEEM/BTC	
0.00017797
4,062 KRW
+4.19%

484.956

즐겨찾기
--
시빅
CVC/BTC	
0.00003541
808 KRW
+5.07%

477.204

즐겨찾기
--
디센트럴랜드
MANA/BTC	
0.00000640
146 KRW
+0.95%

473.326

즐겨찾기
--
아더
ARDR/BTC	
0.00006111
1,395 KRW
-2.52%

468.466

즐겨찾기
--
펀페어
FUN/BTC	
0.00000301
68.70 KRW
-4.44%

431.028

즐겨찾기
--
복셀
VOX/BTC	
0.00001936
442 KRW
-4.44%

427.224

즐겨찾기
--
엣지리스
EDG/BTC	
0.00009268
2,115 KRW
-5.11%

405.658

즐겨찾기
--
베이직어텐션토큰
BAT/BTC	
0.00001953
446 KRW
-7.83%

400.724

즐겨찾기
--
라이즈
RISE/BTC	
0.00003962
904 KRW
-3.34%

360.249

즐겨찾기
--
미스테리움
MYST/BTC	
0.00008500
1,940 KRW
-11.37%

349.655

즐겨찾기
--
오케이캐시
OK/BTC	
0.00003326
759 KRW
-8.32%

346.242

즐겨찾기
--
라디움
RADS/BTC	
0.00059002
13,467 KRW
-11.53%

332.187

즐겨찾기
--
스팀달러
SBD/BTC	
0.00074001
16,891 KRW
-8.94%

330.380

즐겨찾기
--
휴매닉
HMQ/BTC	
0.00002081
475 KRW
-3.34%

330.117

즐겨찾기
--
디크레드
DCR/BTC	
0.00546206
124,672 KRW
+5.74%

329.319

즐겨찾기
--
피벡스
PIVX/BTC	
0.00049000
11,184 KRW
+11.88%

322.750

즐겨찾기
--
엘라스틱
XEL/BTC	
0.00003056
698 KRW
-5.15%

283.447

즐겨찾기
--
페이션토리
PTOY/BTC	
0.00002616
597 KRW
-9.73%

279.196

즐겨찾기
--
퍼스트블러드
1ST/BTC	
0.00003919
895 KRW
-8.71%

213.992

즐겨찾기
--
구피
GUP/BTC	
0.00003652
834 KRW
-8.24%

204.357

즐겨찾기
--
블록틱스
TIX/BTC	
0.00007604
1,736 KRW
-1.93%

200.993

즐겨찾기
--
바이버레이트
VIB/BTC	
0.00001323
302 KRW
+0.53%

199.212

즐겨찾기
--
젠캐시
ZEN/BTC	
0.00217997
49,758 KRW
-3.01%

192.677

즐겨찾기
--
바이트볼
GBYTE/BTC	
0.03184287
726,814 KRW
-9.52%

191.454

즐겨찾기
--
아이젝
RLC/BTC	
0.00006649
1,518 KRW
+14.70%

190.587

즐겨찾기
--
누비츠
NBT/BTC	
0.00005789
1,321 KRW
+3.91%

187.700

즐겨찾기
--
코파운드잇
CFI/BTC	
0.00001236
282 KRW
-7.07%

182.524

즐겨찾기
--
메메틱
MEME/BTC	
0.00004665
1,065 KRW
-6.85%

180.447

즐겨찾기
--
비아코인
VIA/BTC	
0.00021152
4,828 KRW
+5.87%

173.994

즐겨찾기
--
인터넷오브피플
IOP/BTC	
0.00036701
8,377 KRW
+4.44%

173.789

즐겨찾기
--
넥서스
NXS/BTC	
0.00023050
5,261 KRW
+3.34%

172.301

즐겨찾기
--
게임크레딧
GAME/BTC	
0.00019811
4,522 KRW
+8.06%

163.357

즐겨찾기
--
디센트
DCT/BTC	
0.00006499
1,483 KRW
+22.07%

161.263

즐겨찾기
--
팩텀
FCT/BTC	
0.00243300
55,533 KRW
+3.25%

159.911

즐겨찾기
--
언브레이커블코인
UNB/BTC	
0.00009238
2,109 KRW
-13.88%

157.442

즐겨찾기
--
디지털노트
XDN/BTC	
0.00000062
14.15 KRW
+3.33%

133.544

즐겨찾기
--
블랙코인
BLK/BTC	
0.00003423
781 KRW
-4.60%

129.142

즐겨찾기
--
에이엠피
AMP/BTC	
0.00002600
593 KRW
+1.17%

120.997

즐겨찾기
--
메이드세이프
MAID/BTC	
0.00005225
1,193 KRW
+23.41%

114.570

즐겨찾기
--
베리코인
VRC/BTC	
0.00005850
1,335 KRW
-1.94%

110.092

즐겨찾기
--
익스펜스
EXP/BTC	
0.00022093
5,043 KRW
+3.04%

109.789

즐겨찾기
--
뉴메레르
NMR/BTC	
0.00162999
37,205 KRW
+4.49%

108.060

즐겨찾기
--
비트빈
BITB/BTC	
0.00000047
10.73 KRW
+11.90%

107.550

즐겨찾기
--
다이내믹
DYN/BTC	
0.00025455
5,810 KRW
-6.39%

98.160

즐겨찾기
--
신디케이트
SYNX/BTC	
0.00003383
772 KRW
+1.44%

97.286

즐겨찾기
--
코어코인
KORE/BTC	
0.00037285
8,510 KRW
-11.60%

95.237

즐겨찾기
--
노시스 GNO/BTC	

버스트코인 BURST/BTC	

머큐리 MER/BTC	

아라곤 ANT/BTC	

익스클루시브코인 EXCL/BTC	

뱅코르 BNT/BTC	

싱귤러디티비 SNGLS/BTC	

파티클 PART/BTC	

디직스다오 DGD/BTC	

퀀텀리지스턴트렛저 QRL/BTC	

클록코인 CLOAK/BTC	

시베리안체르보네츠 SIB/BTC	

페더코인 FTC/BTC	

트랜스퍼코인 TX/BTC	

윙스다오 WINGS/BTC	

스웜시티토큰 SWT/BTC	

이드니아고라스 AGRS/BTC	

시프트 SHIFT/BTC	

모네터리유닛 MUE/BTC	

블록넷 BLOCK/BTC	

스피어 SPHR/BTC	

아이온 ION/BTC	

비트센드 BSD/BTC	

살루스 SLS/BTC	

싸우럼 XAUR/BTC